app/views/games/show.html.erb

  <div id="winner">
  	<% winner = Lineup.where("game_id = #{@game.id}").where("won_pot = true").first %>
---
SELECT "lineups".* FROM "lineups" WHERE "lineups"."game_id" = $1  [["game_id", 980190962]]

<div id="player_hand">
	<% human_player = @game.players.select { |x| x.human == true }.first %>
	<% human_lineup = @game.lineups.select { |x| x.player_id == human_player.id }.first %>
	<% plays = human_lineup.hands.where("viable_play = true").count %>
	<h2>My Hand</h2>
	<% human_lineup.hands.includes(:card).arranged.each do |h| %>
---
SELECT "players".* FROM "players" INNER JOIN "lineups" ON "players"."id" = "lineups"."player_id" WHERE "lineups"."game_id" = $1  [["game_id", 980190962]]
SELECT COUNT(*) FROM `hands` WHERE `hands`.`lineup_id` = 65
SELECT `hands`.* FROM `hands` WHERE `hands`.`lineup_id` = 54  ORDER BY hands.card_id ASC
SELECT `cards`.* FROM `cards` INNER JOIN `cards_games` ON `cards`.`id` = `cards_games`.`card_id` WHERE `cards_games`.`game_id` = 16  ORDER BY cards.id ASC