app/views/players/show.html.erb


<% if Game.joins(:players).where("players.id = #{@player.id}").where("games.completed = false").present? %>
---
SELECT "games".* FROM "games" INNER JOIN "lineups" ON "lineups"."game_id" = "games"."id" INNER JOIN "players" ON "players"."id" = "lineups"."player_id" WHERE (players.id = 498178451) AND (games.completed = false)