app/views/players/show.html.erb

SELECT COUNT(*) FROM `lineups` WHERE `lineups`.`player_id` = 4
SELECT COUNT(*) FROM `lineups` WHERE `lineups`.`player_id` = 4 AND `lineups`.`won_pot` = 1
SELECT SUM(`lineups`.`amount_paid`) FROM `lineups` WHERE `lineups`.`player_id` = 4
---

<% gp = @player.lineups.count %>
<% gw = @player.lineups.where(won_pot: true).count %>
<% pl = @player.lineups.sum("amount_paid") * -1 %>