app/controllers/cards_controller.rb

SELECT `cards`.* FROM `cards`
---
  def index
    @cards = Card.all

INSERT INTO "cards" ("suit", "name", "abbreviation", "rank", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["suit", "MyString"], ["name", "MyString"], ["abbreviation", "MyString"], ["rank", 1], ["created_at", "2015-05-20 22:14:08.595217"], ["updated_at", "2015-05-20 22:14:08.595217"]]
---
  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save