app/controllers/games_controller.rb

SELECT "players".* FROM "players" INNER JOIN "lineups" ON "players"."id" = "lineups"."player_id" WHERE "lineups"."game_id" = $1  [["game_id", 980190962]]
---
  def show
    @human_lineup = @game.lineups.joins(:player).where("players.human = true").first