app/controllers/games_controller.rb

SELECT `games`.* FROM `games`
---
  def index
    @games = Game.all

INSERT INTO `games` (`turn`, `num_players`, `completed`, `created_at`, `updated_at`) VALUES (1, 4, 0, '2015-04-16 05:42:27.825133', '2015-04-16 05:42:27.825133')
SELECT  `players`.* FROM `players`  ORDER BY `players`.`id` ASC LIMIT 4
INSERT INTO `lineups` (`game_id`, `player_id`, `seat_number`, `created_at`, `updated_at`) VALUES (17, 1, 1, '2015-04-16 05:42:27.872933', '2015-04-16 05:42:27.872933')
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
        # Create lineups for the Players in the Game
        players = Player.first(@game.num_players - 1)
        players << current_player
        players.each_with_index do |player, i|
          lineup = Lineup.create(:game_id => @game.id, :player_id => player.id, :seat_number => i + 1)