app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT `players`.* FROM `players`